{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_1",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "use_bias": true,
            "kernel_regularizer": null,
            "bias_constraint": null,
            "trainable": true,
            "batch_input_shape": [
              null,
              9
            ],
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "seed": null,
                "mode": "fan_avg",
                "distribution": "normal"
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "units": 4,
            "bias_regularizer": null,
            "dtype": "float32",
            "activity_regularizer": null,
            "name": "dense_Dense1",
            "activation": "sigmoid"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_Dense2",
            "activation": "sigmoid",
            "use_bias": true,
            "kernel_regularizer": null,
            "bias_constraint": null,
            "trainable": true,
            "batch_input_shape": [
              null,
              4
            ],
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "mode": "fan_avg",
                "distribution": "normal",
                "scale": 1,
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "units": 5,
            "bias_regularizer": null,
            "dtype": "float32",
            "activity_regularizer": null
          }
        }
      ]
    },
    "backend": "tensor_flow.js",
    "keras_version": "tfjs-layers 2.0.0"
  },
  "weightDataStr": "⇽뼤╥㹛뀌뷫ࣅ븼辒㺆奙㶭쨕뽀ཥ뽃䎰뵩쪹㸫浱불쩁븀ን뼈ⳝ뻝ৢ㸰Ӎ㼍빗叉븻㾦㶪偫뷍铘㷷頚㷯㯐㶚뺪箲뼃詾㼟剫㻣냸뽇℗㰓뻇⯞㼘⾈빡᫤㸑䠆㹏쯣뺙蠻㷇⓿㲃藺㭟瓹뮫抓㱄ẓ㸒ڀ븁兗㶨㌨㽃㻡삵뼾㑚㸿ᜰ㺐㶆빡궯㼬鏼㴜庇뺫㺕㔽뺾癏믄頠㸎䆆㴼홬㺘ˇ㻝ꖫ㼙埂몳섥뱒隽밃䫈㵱ꈈ㵁",
  "weightData": {},
  "convertedBy": null,
  "format": "layers-model",
  "generatedBy": "TensorFlow.js tfjs-layers v2.0.0",
  "weightSpecs": [
    {
      "dtype": "float32",
      "shape": [
        9,
        4
      ],
      "name": "dense_Dense1/kernel"
    },
    {
      "name": "dense_Dense1/bias",
      "dtype": "float32",
      "shape": [
        4
      ]
    },
    {
      "name": "dense_Dense2/kernel",
      "dtype": "float32",
      "shape": [
        4,
        5
      ]
    },
    {
      "name": "dense_Dense2/bias",
      "dtype": "float32",
      "shape": [
        5
      ]
    }
  ]
}